//1995-жылы BRENDAN EICH деген киши киши тарабынан негизделген.
//10кундо жазылган,(6-15)may

// 1)MOCHA
// 2)LIVESCRIPT
// 3)JAVASCRIPT


// JAVASCRIPT маалымат туру

//примитивный простой(primitive)

//NUMBER -- число
//STRING --строка --"" '';
//NULL -- нулевое значение
//UNDEFINED --неопределенное --белгисиз
//BOOLEAN -булевй тип --true,false
//SYMBOL-- $$ символ(любой)
//BIGINT--1212е45466

//ссылочный(reference)
// OBJECT --{}


// var
//let
//const




// +
// /
// %
// *
// -
// **


//----------------------------------------------------------------//

//includes - ичинде тамга бар бекенин чыгарып берет (boolean) турундо
